app/controllers/categories_controller.rb

    def create
      @a = @rname.categories.create(params[:category].permit(:instance, :case, :character, :plurality, :side_note))
---
INSERT INTO "categories" ("instance", "rnaming_id", "created_at", "updated_at", "case", "character", "plurality") VALUES (?, ?, ?, ?, ?, ?, ?)  [["instance", "jj"], ["rnaming_id", 3], ["created_at", "2018-06-13 23:14:41.998680"], ["updated_at", "2018-06-13 23:14:41.998680"], ["case", "jn"], ["character", "kk"], ["plurality", "vg"]]

    def destroy
      @rname.categories.find(params[:id]).destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 2]]

def set_rnaming
  @rname = Rnaming.find(params[:rnaming_id])
---
SELECT  "rnamings".* FROM "rnamings" WHERE "rnamings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]