app/controllers/rnamings_controller.rb

  def index
    @rnamings = Rnaming.all
---
SELECT "rnamings".* FROM "rnamings"

  def create
    @rnaming = Rnaming.new(rnaming_params)

    respond_to do |format|
      if @rnaming.save
---
INSERT INTO "rnamings" ("area", "created_at", "updated_at") VALUES (?, ?, ?)  [["area", "wassup"], ["created_at", "2018-06-04 23:04:19.738041"], ["updated_at", "2018-06-04 23:04:19.738041"]]

  def update
    respond_to do |format|
      if @rnaming.update(rnaming_params)
---
UPDATE "rnamings" SET "area" = ?, "updated_at" = ? WHERE "rnamings"."id" = ?  [["area", "DB"], ["updated_at", "2018-06-07 16:26:34.955220"], ["id", 3]]

  def destroy
    a = @rnaming.categories
    b = a.all.ids
    a.where(:id => b).destroy_all
---
SELECT "categories".* FROM "categories" WHERE "categories"."rnaming_id" = ? AND "categories"."id" IN (4, 6)  [["rnaming_id", 2]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 4]]
DELETE FROM "rnamings" WHERE "rnamings"."id" = ?  [["id", 2]]

    def set_rnaming
      @rnaming = Rnaming.find(params[:id])
---
SELECT  "rnamings".* FROM "rnamings" WHERE "rnamings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]